_posts/2025-11-07-post-halfsync-halfasync.md
```mermaid

flowchart BT
  %% Layers
  subgraph Synchronous_Services_Layer[ Synchronous Services Layer ]
    SS1[Sync Service 1]
    SS2[Sync Service 2]
    SS3[Sync Service 3]
  end

  subgraph Queueing_Layer[ Queueing Layer ]
    Q[[Queue]]
  end

  subgraph Asynchronous_Services_Layer[ Asynchronous Service Layer ]
    AS[Async Service]
    EES[External Event Source]
  end

  %% Sync services <-> Queue
  Q -->|message| SS1
  Q -->|message| SS2
  Q -->|message| SS3

  %% Async service <-> Queue
  
  AS -->|message| Q

  %% External event source -> Async service
  EES -->|Interrupt| AS
```
