_posts/2025-11-07-post-halfsync-halfasync.md
```mermaid
---
config:
  layout: elk
---

sequenceDiagram
    participant EES as : External Event Source
    participant AS  as : Async Service
    participant Q   as : MessageQueue
    participant SS  as : Sync Service

    EES ->> AS: notification
    activate AS

    AS  ->> EES: read()
    EES -->> AS: message

    AS  ->> AS: work()

    AS  ->> Q: putQ(message)
    activate Q

    Q   ->> SS: notification
    activate SS

    SS  ->> Q: getQ()
    Q  -->> SS: message

    SS  ->> SS: work()

    deactivate SS
    deactivate Q
    deactivate AS
```
