_posts/2025-11-07-post-halfsync-halfasync.md
```mermaid
sequenceDiagram
    participant CL  as : Client
    participant RTOR as : Reactor
    participant AS  as : AsyncService
    participant Q   as : MessageQueue
    participant SS  as : Sync Service

    CL ->> RTOR: message

    RTOR ->> AS: handleInput()    
    activate AS

    AS  ->> RTOR: read()
    RTOR -->> AS: message

    AS  ->> Q: putQ(message)
    deactivate AS
    activate Q

    Q   ->> SS: notification
    activate SS

    SS  ->> Q: getQ()
    Q  -->> SS: message

    SS  ->> SS: processService()
    SS  ->> CL: echo message
    deactivate SS
```
