_posts/2025-11-07-post-halfsync-halfasync.md
```mermaid
sequenceDiagram
    participant CL  as : Client
    participant RTOR as : Reactor
    participant ACC  as : Acceptor

    CL ->> RTOR: connect

    RTOR ->> ACC: notification
    activate ACC

    create  participant AS  as : AsyncService
    ACC  ->> AS: create()
 
    create  participant SS  as : SyncService
    AS  ->> SS: create()
    
    create  participant Q  as : MessageQueue
    SS  ->> Q: create()
    %%Q  <<- SS: create()


    ACC  ->> RTOR: registHandler( AsyncService )
    deactivate ACC

    CL ->> RTOR: disconnect

    RTOR ->> ACC: notification
    activate ACC

    ACC  ->> AS: destroy()
    AS  ->> SS: destroy()
    SS  ->> Q: destroy()

    ACC  ->> RTOR: removeHandler( AsyncService )
    deactivate ACC

    destroy  AS
    destroy  Q
    destroy  SS  

```
